/* თითოეულ საკითზე გაეცით პასუხი და მოიყვანეთ მაგალითები! */

/* variables */

// /რა არის ცვლადი (variable)?/;
// ცვლადი არის კონტეინერი რომელშიც მოვათავსებთ მნიშვნელობას შესანახად და მანიპულაციისთვის.
// ცვლადში შეგვიძლია შევინახოთ სხვადასხვა ტიპის მნიშვნელობები; რიცხვები,სტრიქონები,ობიექტები და სხვა.
// let num = 10;   (num)


// /რა არის მინიჭების ოპერატორი (assignment operator)?/;
// მინიჭების ოპერატორი გამოიყენება ცვლადისთვის მნიშვნელობის მინიჭებისთვის
// variable = value;   (=)
// ასევე შეგვიძლი შევცვალოთ არსებული ცვლადის მნიშვნელობა მინიჭების ოპერატორის გამოყენებით:
// let = x;
// x = 5;

// let y = 10;
// y += 5;
// console.log(y);  // Output 15


// // /რა არის მნიშვნელობა (value)?/;
// მნიშვნელობა აღნიშნავს ცვლადში შენახულ მონაცემებს ან ინფორმაციას.
// მნიშვნელობები შეიძლება იყოს სხვადასხვა ფორმები ან ტიპები:
// მაგ: რიცხვები,სტრიქონები,ლოგიკური მნიშვნელობები(true,false),
// null, undefined, ობიექტები, მასივები, ფუნქციები.
// let userName = Nika; (Nika)


/* conditionals */
/რას ეწოდება კოდის ბლოკი (code block)?/;

let age = 19; 
if (age < 18)  {
   // block code
   console.log('You cannot enter!');
} else {
   console.log('You may enter');
}


// /რა არის [if | else | else if]?/;
// if:ამოწმებს პირობას ბლოკის შიგნით თუ პირობა ჭეშმარიტია (true) შესრულდება ბლოლკში არსებული პირობა.
// else if: გამოიყენება რათა მიუთითოთ ახალი პირობა შესამოწმებლად, თუ პირველი პირობა მცდარია(false) 
// და else if ბლოკში არსებული პირობა ჭეშმარიტია შესრულდება if else პირობა .
// else: პირობა შესრულდება თუ ყველა წინა პირობა იქნება მცდარი ანუ (false).
let time = 18;
if (time < 10) {
   greeting = "Good morning";
 } else if (time < 20) {
   greeting = "Good day";
 } else {
   greeting = "Good evening"; 
 }
 console.log(greeting); /*Output Good day*/






